---
kind: type
id: T:Autodesk.Revit.UI.Events.CommandEventArgs
source: html/c3d77fea-4752-aade-9e0b-95cc79461aa6.htm
---
# Autodesk.Revit.UI.Events.CommandEventArgs

The base class of the command Executed and CanExecute event arguments.

## Syntax (C#)
```csharp
public class CommandEventArgs : RevitEventArgs
```